In [2]:
import pandas as pd
import numpy as np
productId = [101, 102, 103, 104, 105]
productName = ['maggi', 'pizza', 'burger', 'franki', 'pasta']
productPrice = [100, 200, 300, 400, 500]

In [46]:
df = pd.DataFrame({
    'productId': productId,
    'productName': productName,
    'productPrice': productPrice
})

In [47]:
df

   productId productName  productPrice
0        101       maggi           100
1        102       pizza           200
2        103      burger           300
3        104      franki           400
4        105       pasta           500

In [5]:
print("Product ID column:")
print(df['productId'])

print("\nProduct Name column:")
print(df['productName'])

print("\nProduct Price column:")
print(df['productPrice'])

Product ID column:
0    101
1    102
2    103
3    104
4    105
Name: productId, dtype: int64

Product Name column:
0     maggi
1     pizza
2    burger
3    franki
4     pasta
Name: productName, dtype: object

Product Price column:
0    100
1    200
2    300
3    400
4    500
Name: productPrice, dtype: int64

In [6]:
print("\nEach row from DataFrame:")
for i in range(len(df)):
    print(df.iloc[i])

Each row from DataFrame:
productId         101
productName     maggi
productPrice      100
Name: 0, dtype: object
productId         102
productName     pizza
productPrice      200
Name: 1, dtype: object
productId          103
productName     burger
productPrice       300
Name: 2, dtype: object
productId          104
productName     franki
productPrice       400
Name: 3, dtype: object
productId         105
productName     pasta
productPrice      500
Name: 4, dtype: object

In [7]:
print(df.loc[2]['productName'])

burger

In [8]:
print(df.iloc[1]['productPrice'])

200

In [9]:
print(df.iloc[1:4, :-1])

   productId productName
1        102       pizza
2        103      burger
3        104      franki

In [10]:
print(df.iloc[0:3, 2])

0    100
1    200
2    300
Name: productPrice, dtype: int64

In [11]:
df=pd.DataFrame(np.random.randint(0,100,(4,4)),index=["hetvi","vrajesh","yash","rushil"],columns=["python","java","c#",".net"])

In [12]:
df

         python  java  c#  .net
hetvi        93    32  71     5
vrajesh      89    89  16     0
yash         66    63  11    90
rushil       28    17  45    81

In [13]:
df.loc[df['python']<40,'python']=41

In [14]:
df

         python  java  c#  .net
hetvi        93    32  71     5
vrajesh      89    89  16     0
yash         66    63  11    90
rushil       41    17  45    81

In [15]:
df += 2
df[df > 100] = 100

In [16]:
df

         python  java  c#  .net
hetvi        95    34  73     7
vrajesh      91    91  18     2
yash         68    65  13    92
rushil       43    19  47    83

In [17]:
df[(df['python']>50) | (df['c#']>60)]

         python  java  c#  .net
hetvi        95    34  73     7
vrajesh      91    91  18     2
yash         68    65  13    92

In [18]:
df[df.index.str.startswith('v')]

         python  java  c#  .net
vrajesh      91    91  18     2

In [19]:
df[df.index.str.endswith('l')]

        python  java  c#  .net
rushil      43    19  47    83

In [20]:
df['Total'] = df.sum(axis=1)
df['Percentage'] = (df['Total'] / 500) * 100

In [21]:
df

         python  java  c#  .net  Total  Percentage
hetvi        95    34  73     7    209        41.8
vrajesh      91    91  18     2    202        40.4
yash         68    65  13    92    238        47.6
rushil       43    19  47    83    192        38.4

In [22]:
 df.apply(lambda row: 'PASS' if row['Percentage'] >= 40 else 'FAIL', axis=1)

hetvi      PASS
vrajesh    PASS
yash       PASS
rushil     FAIL
dtype: object

In [23]:
def calculate_grade(percentage):
    if percentage >= 90:
        return 'A'
    elif percentage >= 80:
        return 'B'
    elif percentage >= 90:
        return 'C'
    elif percentage >= 80:
        return 'D'
    elif percentage >= 70:
        return 'E'
    else:
        return 'F'
df['Grade'] = df['Percentage'].apply(calculate_grade)

In [24]:
df

         python  java  c#  .net  Total  Percentage Grade
hetvi        95    34  73     7    209        41.8     F
vrajesh      91    91  18     2    202        40.4     F
yash         68    65  13    92    238        47.6     F
rushil       43    19  47    83    192        38.4     F

In [25]:
df.describe().loc[['mean', 'max', 'min', 'std']]

         python       java         c#       .net       Total  Percentage
mean  74.250000  52.250000  37.750000  46.000000  210.250000   42.050000
max   95.000000  91.000000  73.000000  92.000000  238.000000   47.600000
min   43.000000  19.000000  13.000000   2.000000  192.000000   38.400000
std   23.991318  32.159757  27.873225  48.104054   19.771613    3.954323

In [37]:
df.to_excel('students.xlsx', index=False)
df.to_json('students.json', orient='records')
df.to_html('students.html', index=False)

In [38]:
df

         python  java  c#  .net  Total  Percentage Grade
hetvi        95    34  73     7    209        41.8     F
vrajesh      91    91  18     2    202        40.4     F
yash         68    65  13    92    238        47.6     F
rushil       43    19  47    83    192        38.4     F

In [28]:
metadata = df.dtypes

In [29]:
df

         python  java  c#  .net  Total  Percentage Grade
hetvi        95    34  73     7    209        41.8     F
vrajesh      91    91  18     2    202        40.4     F
yash         68    65  13    92    238        47.6     F
rushil       43    19  47    83    192        38.4     F

In [30]:
df.to_dict(orient='list')

{'python': [95, 91, 68, 43],
 'java': [34, 91, 65, 19],
 'c#': [73, 18, 13, 47],
 '.net': [7, 2, 92, 83],
 'Total': [209, 202, 238, 192],
 'Percentage': [41.8, 40.400000000000006, 47.599999999999994, 38.4],
 'Grade': ['F', 'F', 'F', 'F']}

In [44]:
df['productPrice']+=500

In [45]:
df

   productId productName  productPrice
0        101       maggi           600
1        102       pizza           700
2        103      burger           800
3        104      franki           900
4        105       pasta          1000